# pandas

- 新的数据格式 .csv
- 纯文本
- 每条记录被分隔符分隔为字段
- 每条记录都有同样的字段序列

In [109]:
import pandas as pd

In [110]:
#df=pd.read_csv('路径')
df=pd.read_csv('/Users/Florian_Gao/Desktop/git/github/wanmen-python/modol.csv', sep=',') # sep 分隔符格式

In [111]:
df

   序号 姓名 性别   语文   数学   英语
0   1  高  男  120  110  130
1   2  李  男  110  129  131
2   3  赵  女  111  123  124
3   4  孙  女  124  145  143
4   5  兰  男  122  133  144

In [112]:
#打印几行
df.head(2)

   序号 姓名 性别   语文   数学   英语
0   1  高  男  120  110  130
1   2  李  男  110  129  131

In [113]:
type(df)

pandas.core.frame.DataFrame

In [114]:
#列名
print(df.columns)
#索引
print(df.index)

Index(['序号', '姓名', '性别', '语文', '数学', '英语'], dtype='object')
RangeIndex(start=0, stop=5, step=1)

In [115]:
# 第0行
df.loc[0]

序号      1
姓名      高
性别      男
语文    120
数学    110
英语    130
Name: 0, dtype: object

## 筛选

In [116]:
# the first column is 序号
df.columns[0]

'序号'

In [117]:
df.数学>3

0    True
1    True
2    True
3    True
4    True
Name: 数学, dtype: bool

In [118]:
df[df.数学>3]

   序号 姓名 性别   语文   数学   英语
0   1  高  男  120  110  130
1   2  李  男  110  129  131
2   3  赵  女  111  123  124
3   4  孙  女  124  145  143
4   5  兰  男  122  133  144

## 复杂筛选

In [119]:
# 语文<4，数学>2
df[(df.语文<4)&(df.数学>2)]

Empty DataFrame
Columns: [序号, 姓名, 性别, 语文, 数学, 英语]
Index: []

## 排序

In [120]:
#先按数学排序，再按语文排序
df.sort_values(['数学','语文'])

   序号 姓名 性别   语文   数学   英语
0   1  高  男  120  110  130
2   3  赵  女  111  123  124
1   2  李  男  110  129  131
4   5  兰  男  122  133  144
3   4  孙  女  124  145  143

## 访问

In [121]:
#按索引位  第四行  /0 1 2 3
df.loc[3]

序号      4
姓名      孙
性别      女
语文    124
数学    145
英语    143
Name: 3, dtype: object

## 索引

In [122]:
scores={
    'Name':['gao','li','wang'],
    'English':[120,110,130],
    'Math':[122,132,143]
}
dp=pd.DataFrame(scores,index=['one','two','three']) # 这里自己制定的索引形式
dp

       Name  English  Math
one     gao      120   122
two      li      110   132
three  wang      130   143

In [123]:
dp.index

Index(['one', 'two', 'three'], dtype='object')

In [124]:
#dp.loc[1]  #此时索引位0ne，two，three
dp.loc['one']

Name       gao
English    120
Math       122
Name: one, dtype: object

In [125]:
dp.iloc[0]  #这个就可以实现不按index进行操作

Name       gao
English    120
Math       122
Name: one, dtype: object

In [126]:
#合并loc和iloc
dp.ix[0]

/Users/Florian_Gao/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

Name       gao
English    120
Math       122
Name: one, dtype: object

In [127]:
# 也可进行切片，打印前两行
dp.iloc[:2]

    Name  English  Math
one  gao      120   122
two   li      110   132

In [136]:
#访问某一行，是错误的
#dp[0]
#访问前两行就可以,可以使用切片
dp[:2]

    Name  English  Math math classify
one  gao      120   122          good
two   li      110   132     very good

In [137]:
dp.Math.values

array([122, 132, 143])

In [138]:
#简单技术
dp.Math.value_counts()

143    1
122    1
132    1
Name: Math, dtype: int64

# <font color='red'>重点</font>

In [139]:
df

   序号 姓名 性别   语文   数学   英语    new_line math classify
0   1  高  男  120  110  130  keep going    keep going
1   2  李  男  110  129  131        good          good
2   3  赵  女  111  123  124        good          good
3   4  孙  女  124  145  143   very good     very good
4   5  兰  男  122  133  144   very good     very good

In [135]:
def func(score):
    if score>=130:
        return 'very good'
    elif score>=120:
        return 'good'
    else:
        return 'keep going'
#dp['math classify']=dp.Math.map(func)
df['math classify']=df.数学.map(func)
df

   序号 姓名 性别   语文   数学   英语    new_line math classify
0   1  高  男  120  110  130  keep going    keep going
1   2  李  男  110  129  131        good          good
2   3  赵  女  111  123  124        good          good
3   4  孙  女  124  145  143   very good     very good
4   5  兰  男  122  133  144   very good     very good

## 同样的，用apply也可以实现增加一行

In [140]:
#多列形成一个新列
dp['new_score']=dp.apply(lambda x: x.Math+ x.English,axis=1)
dp

       Name  English  Math math classify  new_score
one     gao      120   122          good        242
two      li      110   132     very good        242
three  wang      130   143     very good        273

In [94]:
#前两行
dp.head(2)
#后两行
dp.tail(2)

       Name  English  Math math classify  new_score
two      li      110   132     very good        242
three  wang      130   143     very good        273

# 全局使用，以及lambda函数使用

In [95]:
# x 表示所有元素
dp.applymap(lambda x: '%'+str(x)+ '%')

         Name English   Math math classify new_score
one     %gao%   %120%  %122%        %good%     %242%
two      %li%   %110%  %132%   %very good%     %242%
three  %wang%   %130%  %143%   %very good%     %273%

## 匿名函数

In [96]:
def func(x):
    return x+100

In [97]:
list(map(func,range(10)))

[100, 101, 102, 103, 104, 105, 106, 107, 108, 109]